In [3]:
import pandas as pd
df1 = pd.DataFrame({
    'Name':['Arshiyan','Kashif','Babar','Hamza'],
    'Age':[22,20,27,18],
    'Role':['DS-ENGINEER','CIVIL-ENG','OFFICE','BEGGER']
})
df1

       Name  Age         Role
0  Arshiyan   22  DS-ENGINEER
1    Kashif   20    CIVIL-ENG
2     Babar   27       OFFICE
3     Hamza   18       BEGGER

In [36]:
df1.iloc[0]

Name       Arshiyan
Age              22
Role    DS-ENGINEER
Name: 0, dtype: object

In [38]:
df1.iloc[0,1] #df(Dataframe name).iloc[row,column]

22

In [46]:
df1.iloc[0:2,:]

       Name  Age         Role
0  Arshiyan   22  DS-ENGINEER
1    Kashif   20    CIVIL-ENG

In [49]:
df1.iloc[0:2,[1,2]]

   Age         Role
0   22  DS-ENGINEER
1   20    CIVIL-ENG

In [50]:
import pandas as pd

df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Price': [10, 15, 20, 25],
    'Stock': [100, 150, 200, 250]
}, index=['P1', 'P2', 'P3', 'P4'])
df

   Product  Price  Stock
P1       A     10    100
P2       B     15    150
P3       C     20    200
P4       D     25    250

In [54]:
df.loc['P2',"Price"] #df(Dataframe name).loc[row,column]

15

In [57]:
df.loc['P1':'P3']

   Product  Price  Stock
P1       A     10    100
P2       B     15    150
P3       C     20    200

In [60]:
df.loc[df['Price']>15,["Product","Stock"]]

   Product  Stock
P3       C    200
P4       D    250